app/controllers/songs_controller.rb

  def new

    if params[:artist_id] && !Artist.find_by_id(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]

  def edit

    if params[:artist_id] && !Artist.find_by_id(params[:artist_id])
      redirect_to artists_path
    elsif params[:artist_id] && Artist.find_by_id(params[:artist_id])
      @song = Song.find_by_id(params[:id])
      @artist = Artist.find_by_id(params[:artist_id])
      if !@artist.songs.include?(@song)
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 10]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
SELECT "artists".* FROM "artists"